NixOS/benchmarks/HPC/openfoam/OpenFOAM-v2306/tutorials/verificationAndValidation/atmosphericModels/atmFlatTerrain/successor/setups.orig/common/Allrun-parallel
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

./Allrun.pre

runApplication decomposePar

runParallel $(getApplication)

runApplication reconstructPar

#------------------------------------------------------------------------------
